<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"cb9fe6231f2c7873356287fbb5534fccc435a0427b08edf16d96a18be5297d3a","plan_job_ref":"Job Terraform checks on pull request #14 at https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/13419575111","plan_out_hash":"ae7b916dc69f6ddc4e9333c5d2bf6206e8b8d64c23d5d675d41cf1ae02c34c4a","plan_hash":"89eca38b58bb90babc02f0bf7e66ca8c49418e0561f5cdad49a11cc7a1be7af2","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __./infrastructure/example-account__
<details>
<summary>Plan: 44 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.aws_kms_key.known_keys["processed"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = "************************"
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.lambda.data.aws_kms_key.known_keys["raw"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = "******************"
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.lambda.data.aws_sns_topic.known_topics["etl-failure"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sns_topic" "known_topics" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "aws-dev-demo-etl-failure"
+       tags = (known after apply)
    }

  # module.s3_bucket_notifications.data.aws_lambda_function.known_lambdas["unzip"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "known_lambdas" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       code_signing_config_arn        = (known after apply)
+       dead_letter_config             = (known after apply)
+       description                    = (known after apply)
+       environment                    = (known after apply)
+       ephemeral_storage              = (known after apply)
+       file_system_config             = (known after apply)
+       function_name                  = "aws-dev-demo-unzip-lambda"
+       handler                        = (known after apply)
+       id                             = (known after apply)
+       image_uri                      = (known after apply)
+       invoke_arn                     = (known after apply)
+       kms_key_arn                    = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = (known after apply)
+       logging_config                 = (known after apply)
+       memory_size                    = (known after apply)
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = (known after apply)
+       role                           = (known after apply)
+       runtime                        = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = (known after apply)
+       timeout                        = (known after apply)
+       tracing_config                 = (known after apply)
+       version                        = (known after apply)
+       vpc_config                     = (known after apply)
    }

  # module.s3_files.data.aws_sns_topic.known_topics["etl-failure"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sns_topic" "known_topics" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "aws-dev-demo-etl-failure"
+       tags = (known after apply)
    }

  # module.lambda.module.lambda.data.aws_caller_identity.current_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current_account" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.lambda.module.lambda.data.aws_iam_policy_document.attached_policies["unzip"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "attached_policies" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-processed",
+               "arn:aws:s3:::dev-demo-raw",
            ]
+           sid       = "ListS3Buckets"
        }
+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-raw/*",
            ]
+           sid       = "GetS3Objects"
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-processed/*",
            ]
+           sid       = "PutS3Objects"
        }
+       statement {
+           actions   = [
+               "kms:Decrypt",
+               "kms:GenerateDataKey",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowKMSDecryptForS3"
        }
+       statement {
+           actions   = [
+               "sns:Publish",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPublishToSNS"
        }
+       statement {
+           actions   = [
+               "ec2:AttachNetworkInterface",
+               "ec2:CreateNetworkInterface",
+               "ec2:DeleteNetworkInterface",
+               "ec2:DescribeInstances",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "RequiredEC2BasicPermissions"
        }
+       statement {
+           actions   = [
+               "ec2:DescribeNetworkInterfaces",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "RequiredEC2NetworkInterfacePermissions"
        }
    }

  # module.lambda.module.lambda.data.aws_region.current_region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current_region" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.data.aws_kms_key.known_keys["processed"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = (known after apply)
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.data.aws_kms_key.known_keys["raw"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = (known after apply)
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_alias.aliases["processed"] will be created
+   resource "aws_kms_alias" "aliases" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/dev-demo-processed"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_alias.aliases["raw"] will be created
+   resource "aws_kms_alias" "aliases" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/dev-demo-raw"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_key_policy.policies["processed"] will be created
+   resource "aws_kms_key_policy" "policies" {
+       bypass_policy_lockout_safety_check = false
+       id                                 = (known after apply)
+       key_id                             = (known after apply)
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::741139166799:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Enable IAM User Permissions"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.s3_bucket.module.s3_bucket.aws_kms_key_policy.policies["raw"] will be created
+   resource "aws_kms_key_policy" "policies" {
+       bypass_policy_lockout_safety_check = false
+       id                                 = (known after apply)
+       key_id                             = (known after apply)
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::741139166799:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Enable IAM User Permissions"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
    }

  # module.s3_bucket.module.s3_bucket.aws_s3_object.prefixes["processed/dogs/daily/"] will be created
+   resource "aws_s3_object" "prefixes" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-demo-processed"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dogs/daily/"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "/dev/null"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.aws_s3_object.prefixes["raw/dogs/landing/"] will be created
+   resource "aws_s3_object" "prefixes" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-demo-raw"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dogs/landing/"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "/dev/null"
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.data.aws_s3_bucket.s3_buckets["dev-demo-raw"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "s3_buckets" {
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-raw"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.aws_lambda_permission.allow_lambda_execution_from_bucket["dev-demo-raw/aws-dev-demo-unzip-lambda"] will be created
+   resource "aws_lambda_permission" "allow_lambda_execution_from_bucket" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "aws-dev-demo-unzip-lambda"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       source_arn          = (known after apply)
+       statement_id        = "**************************"
+       statement_id_prefix = (known after apply)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.aws_s3_bucket_notification.bucket_notification["dev-demo-raw"] will be created
+   resource "aws_s3_bucket_notification" "bucket_notification" {
+       bucket      = (known after apply)
+       eventbridge = true
+       id          = (known after apply)

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "dogs/landing/"
+           filter_suffix       = ".zip"
+           id                  = (known after apply)
+           lambda_function_arn = (known after apply)
        }
    }

  # module.s3_files.module.s3_files.aws_s3_object.uploaded_files["config"] will be created
+   resource "aws_s3_object" "uploaded_files" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "dev-demo-lambda-assets"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content                = (known after apply)
+       content_type           = (known after apply)
+       etag                   = "0742dc1d5f0eb68c1cc8ce4401db4d4c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "config/unzip.json"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       storage_class          = (known after apply)
+       tags_all               = (known after apply)
+       version_id             = (known after apply)
    }

  # module.sns.module.sns.aws_sns_topic.topics["etl-failure"] will be created
+   resource "aws_sns_topic" "topics" {
+       arn                         = (known after apply)
+       beginning_archive_time      = (known after apply)
+       content_based_deduplication = false
+       fifo_topic                  = false
+       id                          = (known after apply)
+       name                        = "aws-dev-demo-etl-failure"
+       name_prefix                 = (known after apply)
+       owner                       = (known after apply)
+       policy                      = (known after apply)
+       signature_version           = (known after apply)
+       tags_all                    = (known after apply)
+       tracing_config              = (known after apply)
    }

  # module.sns.module.sns.aws_sns_topic_subscription.subscriptions["etl-failure/enquires_alert"] will be created
+   resource "aws_sns_topic_subscription" "subscriptions" {
+       arn                             = (known after apply)
+       confirmation_timeout_in_minutes = 1
+       confirmation_was_authenticated  = (known after apply)
+       endpoint                        = "enquires@sudoblark.com"
+       endpoint_auto_confirms          = false
+       filter_policy_scope             = (known after apply)
+       id                              = (known after apply)
+       owner_id                        = (known after apply)
+       pending_confirmation            = (known after apply)
+       protocol                        = "email"
+       raw_message_delivery            = false
+       topic_arn                       = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket.s3_bucket will be created
+   resource "aws_s3_bucket" "s3_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-lambda-assets"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket_lifecycle_configuration.lifecycle_rule will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule" {
+       bucket                                 = (known after apply)
+       expected_bucket_owner                  = (known after apply)
+       id                                     = (known after apply)
+       transition_default_minimum_object_size = "all_storage_classes_128K"

+       rule {
+           id     = "multipart_upload_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 7
            }
        }
+       rule {
+           id     = "expiration_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           expiration {
+               days                         = 365
+               expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket_logging.bucket_logging[0] will be created
+   resource "aws_s3_bucket_logging" "bucket_logging" {
+       bucket        = (known after apply)
+       id            = (known after apply)
+       target_bucket = "dev-demo-logging"
+       target_prefix = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket_public_access_block.bpa_s3_bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bpa_s3_bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket_server_side_encryption_configuration.encryption[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["lambda-assets"].aws_s3_bucket_versioning.bucket_versioning[0] will be created
+   resource "aws_s3_bucket_versioning" "bucket_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["logging"].aws_s3_bucket.s3_bucket will be created
+   resource "aws_s3_bucket" "s3_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-logging"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["logging"].aws_s3_bucket_lifecycle_configuration.lifecycle_rule will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule" {
+       bucket                                 = (known after apply)
+       expected_bucket_owner                  = (known after apply)
+       id                                     = (known after apply)
+       transition_default_minimum_object_size = "all_storage_classes_128K"

+       rule {
+           id     = "multipart_upload_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 7
            }
        }
+       rule {
+           id     = "expiration_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           expiration {
+               days                         = 365
+               expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["logging"].aws_s3_bucket_public_access_block.bpa_s3_bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bpa_s3_bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["logging"].aws_s3_bucket_server_side_encryption_configuration.encryption[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "encryption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["logging"].aws_s3_bucket_versioning.bucket_versioning[0] will be created
+   resource "aws_s3_bucket_versioning" "bucket_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_kms_key.customer_managed_key[0] will be created
+   resource "aws_kms_key" "customer_managed_key" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "S3 key to encrypt contents within dev-demo-processed"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = (known after apply)
+       rotation_period_in_days            = (known after apply)
+       tags_all                           = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket.s3_bucket will be created
+   resource "aws_s3_bucket" "s3_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-processed"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket_lifecycle_configuration.lifecycle_rule will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule" {
+       bucket                                 = (known after apply)
+       expected_bucket_owner                  = (known after apply)
+       id                                     = (known after apply)
+       transition_default_minimum_object_size = "all_storage_classes_128K"

+       rule {
+           id     = "multipart_upload_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 7
            }
        }
+       rule {
+           id     = "expiration_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           expiration {
+               days                         = 365
+               expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket_logging.bucket_logging[0] will be created
+   resource "aws_s3_bucket_logging" "bucket_logging" {
+       bucket        = (known after apply)
+       id            = (known after apply)
+       target_bucket = "dev-demo-logging"
+       target_prefix = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket_public_access_block.bpa_s3_bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bpa_s3_bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket_server_side_encryption_configuration.cmk[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "cmk" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               kms_master_key_id = (known after apply)
+               sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["processed"].aws_s3_bucket_versioning.bucket_versioning[0] will be created
+   resource "aws_s3_bucket_versioning" "bucket_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_kms_key.customer_managed_key[0] will be created
+   resource "aws_kms_key" "customer_managed_key" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "*****************"
+       description                        = "S3 key to encrypt contents within dev-demo-raw"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = (known after apply)
+       rotation_period_in_days            = (known after apply)
+       tags_all                           = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket.s3_bucket will be created
+   resource "aws_s3_bucket" "s3_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-raw"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket_lifecycle_configuration.lifecycle_rule will be created
+   resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule" {
+       bucket                                 = (known after apply)
+       expected_bucket_owner                  = (known after apply)
+       id                                     = (known after apply)
+       transition_default_minimum_object_size = "all_storage_classes_128K"

+       rule {
+           id     = "multipart_upload_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 7
            }
        }
+       rule {
+           id     = "expiration_default_rule"
+           prefix = (known after apply)
+           status = "Enabled"

+           expiration {
+               days                         = 365
+               expired_object_delete_marker = (known after apply)
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket_logging.bucket_logging[0] will be created
+   resource "aws_s3_bucket_logging" "bucket_logging" {
+       bucket        = (known after apply)
+       id            = (known after apply)
+       target_bucket = "dev-demo-logging"
+       target_prefix = (known after apply)
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket_public_access_block.bpa_s3_bucket will be created
+   resource "aws_s3_bucket_public_access_block" "bpa_s3_bucket" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket_server_side_encryption_configuration.cmk[0] will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "cmk" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               kms_master_key_id = (known after apply)
+               sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.s3_bucket.module.s3_bucket.module.s3_bucket["raw"].aws_s3_bucket_versioning.bucket_versioning[0] will be created
+   resource "aws_s3_bucket_versioning" "bucket_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       log_group_class   = (known after apply)
+       name              = "/aws/lambda/aws-dev-demo-unzip-lambda"
+       name_prefix       = (known after apply)
+       retention_in_days = 14
+       skip_destroy      = false
+       tags              = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       tags_all          = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "aws-dev-demo-unzip-lambda"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       tags_all         = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = "aws-dev-demo-unzip-lambda-logs"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       tags_all         = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "aws-dev-demo-unzip-lambda"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       tags_all              = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       unique_id             = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "aws-dev-demo-unzip-lambda"
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "aws-dev-demo-unzip-lambda"
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       description                    = "Simple lambda to unzip known viewings of dogs from raw to processed bucket."
+       filename                       = "../modules/lambda/../../../application/unzip-lambda/unzip_lambda/src/lambda.zip"
+       function_name                  = "aws-dev-demo-unzip-lambda"
+       handler                        = "lambda_function.lambda_handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = []
+       memory_size                    = 512
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.9"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       tags_all                       = {
+           "Name" = "aws-dev-demo-unzip-lambda"
        }
+       timeout                        = 900
+       version                        = (known after apply)

+       environment {
+           variables = (known after apply)
        }

+       ephemeral_storage {
+           size = 512
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_lambda_function_event_invoke_config.this["unqualified_alias"] will be created
+   resource "aws_lambda_function_event_invoke_config" "this" {
+       function_name          = "aws-dev-demo-unzip-lambda"
+       id                     = (known after apply)
+       maximum_retry_attempts = 2
    }

Plan: 44 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform checks on pull request #14](https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/13419575111)